app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs" ORDER BY created_at DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "blogs"
---
	def index
      @blog_posts = Blog.order("created_at DESC").page params[:page]

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def show
      @blogpost = Blog.find(params[:id])