app/controllers/customers_controller.rb

INSERT INTO "customers" ("city", "comment", "country", "created_at", "email", "name", "phone", "state", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
	def create
	 customer = Customer.new(params["customer"])
	 CustomerMailer.thanks(customer).deliver
	 render :json => {:success => customer.save}